Revit 2025 API
FormattedText(String) Constructor
 Creates a new FormattedText object with unformatted text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public FormattedText(
	string plainText
)
Public Sub New (
	plainText As String
)
public:
FormattedText(
	String^ plainText
)
new :
        plainText : string -> FormattedText
Parameters
plainText String
 The text in a plain text form.
Exceptions
Exception | Condition
ArgumentException |  plainText (excluding a carriage return character ('\r') at the end) has more than 30,000 characters. -or- plainText contains invalid characters such as a newline character.
ArgumentNullException |  A non-optional argument was null
Remarks
 The given text should have no more than 30,000 characters. Line feed characters ('/n') are not allowed. An empty string is allowed.
Example
public void ReformatText(TextNote textNote, string textToChange)
{
    String plainText = textNote.Text;
    FormattedText formattedText = new FormattedText(plainText);
    TextRange foundRange = formattedText.Find(textToChange, 0, false, true);
    while (foundRange.Length > 0)
    {
        formattedText.SetBoldStatus(foundRange, true);
        foundRange = formattedText.Find(textToChange, foundRange.End, false, true);
    }
    textNote.SetFormattedText(formattedText);
}
Public Sub ReformatText(textNote As TextNote, textToChange As String)
    Dim plainText As [String] = textNote.Text
    Dim formattedText As New FormattedText(plainText)
    Dim foundRange As TextRange = formattedText.Find(textToChange, 0, False, True)
    While foundRange.Length > 0
        formattedText.SetBoldStatus(foundRange, True)
        foundRange = formattedText.Find(textToChange, foundRange.[End], False, True)
    End While
    textNote.SetFormattedText(formattedText)
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
FormattedText Class
FormattedText Overload
Autodesk.Revit.DB Namespace